src/DataProcessors/инкПечатьПриказВКомандировку/инкПечатьПриказВКомандировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инкПечатьПриказВКомандировку</name>
  <attributes>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef.инкПриказВКомандировку</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Catalogs/инкСотрудники/инкСотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкСотрудники</name>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыдан</name>
    <type>
      <types>CatalogRef.инкПодразделенияВыдачиДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>CatalogRef.инкВидыДокументовФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.инкЗарплатныеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетКодВычета</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетКодФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетНомерУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмущественныйВычетСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иностранец</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительныйЛистПроцент</name>
    <type>
      <types>EnumRef.инкИсполнительныйЛистПроцент</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОблагаемыйДоходСНачалаГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаСтандартныхНалоговыхВычетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.инкПол</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Совместитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СовместительДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИностранца</name>
    <type>
      <types>EnumRef.инкСтатусыИностранцев</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРезидента</name>
    <type>
      <types>EnumRef.инкСтатусыРезидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловия</name>
    <type>
      <types>EnumRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСокращенное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоСотрудника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НалоговыеВычеты</name>
    <attributes>
      <name>ВычетНДФЛ</name>
      <type>
        <types>CatalogRef.инкВычетыНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РодственныеСвязи</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРодственнойСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоходСоСтраховыхВзносов</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоходСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсключениеДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеиспользованныйОтпуск</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>EnumRef.инкВидыОтпуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/инкПечатьПриказВКомандировку/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция - Получить печатный документ на сервере
//
// Параметры:
//  ДокументСсылка	 - Ссылка - Ссылка на документ (источник данных); 
//  ИмяОтчета		 - Строка - Имя отчета "Т9" или "Т10";
// 
// Возвращаемое значение:
// 	ТабличныйДокумент  - Кадровый приказ Т-10 или Т-9;
//
Функция ПолучитьПечатныйДокументНаСервере(ДокументСсылка,ИмяОтчета) Экспорт
	
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если Не ЗначениеЗаполнено(ДокументСсылка.Ссылка) Тогда
		Возврат ОтпускТабличныйДокумент;	
	КонецЕсли;	
	
	Если ИмяОтчета = "Т9" Тогда
		ОтпускТабличныйДокумент = ПолучитьДокументТ9(ДокументСсылка);  
	ИначеЕсли ИмяОтчета = "Т10" Тогда	
		ОтпускТабличныйДокумент = ПолучитьДокументТ10(ДокументСсылка);  
	КонецЕсли;
	
	Возврат ОтпускТабличныйДокумент;
	
КонецФункции                      

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументТ9(ДокументСсылка)
	
	МакетВедомости = ПолучитьМакет("ПФ_MXL_Т9"); 
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент; 
	
	КадровыеДанныеСотрудника = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Сотрудник);
	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Ответсвенный);
	
	// Приказ:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Приказ");   
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНаименованиеСокращенное = ДокументСсылка.Организация;					
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияКодПоОКПО = ДокументСсылка.Организация.ОКПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектНомерНаПечать = ДокументСсылка.Номер;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДата = ДокументСсылка.Дата;				
	ОбластьДокумента.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = ДокументСсылка.Сотрудник.ФИО;				
	ОбластьДокумента.Параметры.РаботаСотрудникТабельныйНомерНаПечать = ДокументСсылка.Сотрудник.ТабельныйНомер;	
	
	Если ЗначениеЗаполнено(КадровыеДанныеСотрудника) Тогда
		ОбластьДокумента.Параметры.РаботаПодразделениеНаПечать = КадровыеДанныеСотрудника.Подразделение;				
		ОбластьДокумента.Параметры.РаботаДолжность = КадровыеДанныеСотрудника.Должность;				
	КонецЕсли;
	
	ОбластьДокумента.Параметры.СсылкаНаОбъектМестоНазначения = ДокументСсылка.Место;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНазначения = "";				
	ОбластьДокумента.Параметры.СсылкаНаОбъектПродолжительность = ДокументСсылка.КоличествоДнейКомандировки;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаНачала	= ДокументСсылка.ПериодС;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОкончания = ДокументСсылка.ПериодПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектЦель = ДокументСсылка.Цель;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектКомандировкаЗаСчетСредств = ДокументСсылка.ЗаСчетСредств;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектОснование = ДокументСсылка.ОснованиеДляКомандировки;
	
	Если ЗначениеЗаполнено(КадровыеДанныеРуководителя) Тогда
		ОбластьДокумента.Параметры.СсылкаНаОбъектДолжностьРуководителя = КадровыеДанныеРуководителя.Должность;				
		ОбластьДокумента.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи	 = ДокументСсылка.Ответственный.ФИОСокращенное;				
	КонецЕсли; 
	
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОзнакомленияРаботника = "";				
	
	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	Возврат ОтпускТабличныйДокумент; 
	
КонецФункции                      

Функция ПолучитьДокументТ10(ДокументСсылка)
	
	МакетВедомости = ПолучитьМакет("ПФ_MXL_Т10"); 
	ОтпускТабличныйДокумент = Новый ТабличныйДокумент; 
	
	КадровыеДанныеСотрудника = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Сотрудник);
	КадровыеДанныеРуководителя = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ДокументСсылка.Ответсвенный);

	// Приказ:			   
	ОбластьДокумента = МакетВедомости.ПолучитьОбласть("Приказ");          
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНаименованиеСокращенное = ДокументСсылка.Организация;					
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияКодПоОКПО = ДокументСсылка.Организация.ОКПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектНомерНаПечать = ДокументСсылка.Номер;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДата = ДокументСсылка.Дата;				
    ОбластьДокумента.Параметры.ЛичныеДанныеФИОФамилияИмяОтчество = ДокументСсылка.Сотрудник.ФИО;				
	ОбластьДокумента.Параметры.РаботаСотрудникТабельныйНомерНаПечать = ДокументСсылка.Сотрудник.ТабельныйНомер;	
	
	Если ЗначениеЗаполнено(КадровыеДанныеСотрудника) Тогда
		ОбластьДокумента.Параметры.РаботаПодразделениеНаПечать = КадровыеДанныеСотрудника.Подразделение;				
		ОбластьДокумента.Параметры.РаботаДолжность = КадровыеДанныеСотрудника.Должность;	            
	КонецЕсли;
	
	ОбластьДокумента.Параметры.ЛичныеДанныеДокументУдостоверяющийЛичностьПредставление = Справочники.инкСотрудники.ПолучитьДанныеУдостоверяющегоДокументаСотрудника(ДокументСсылка.Сотрудник);							
	ОбластьДокумента.Параметры.СсылкаНаОбъектПродолжительностьБезУчетаВремениВПути = ДокументСсылка.КоличествоДнейКомандировки;
	ОбластьДокумента.Параметры.СсылкаНаОбъектМестоНазначения = ДокументСсылка.Место;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектОрганизацияНазначения = "";				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаНачала	= ДокументСсылка.ПериодС;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектДатаОкончания = ДокументСсылка.ПериодПО;				
	ОбластьДокумента.Параметры.СсылкаНаОбъектЦель = ДокументСсылка.Цель;	
	
	Если ЗначениеЗаполнено(КадровыеДанныеРуководителя) Тогда
		ОбластьДокумента.Параметры.СсылкаНаОбъектДолжностьРуководителя = КадровыеДанныеРуководителя.Должность;				
		ОбластьДокумента.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи	 = ДокументСсылка.Ответственный.ФИОСокращенное;				
	КонецЕсли;
	
	ОтпускТабличныйДокумент.Вывести(ОбластьДокумента);
	
	Возврат ОтпускТабличныйДокумент; 
	
КонецФункции                      

#КонецОбласти

#КонецЕсли
